esp-rs/esp-pacs/esp32s2-ulp/svd/esp32s2-ulp.base.svd
        <register>
          <name>CMD0</name>
          <description>RTC I2C Command 0</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000903</resetValue>
          <fields>
            <field>
              <name>COMMAND0</name>
              <description>Content of command 0. For more information, please refer to the register
I2C_COMD0_REG in Chapter I²C Controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND0_DONE</name>
              <description>When command 0 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD1</name>
          <description>RTC I2C Command 1</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001901</resetValue>
          <fields>
            <field>
              <name>COMMAND1</name>
              <description>Content of command 1. For more information, please refer to the register
I2C_COMD1_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND1_DONE</name>
              <description>When command 1 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD2</name>
          <description>RTC I2C Command 2</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000902</resetValue>
          <fields>
            <field>
              <name>COMMAND2</name>
              <description>Content of command 2. For more information, please refer to the register
I2C_COMD2_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND2_DONE</name>
              <description>When command 2 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD3</name>
          <description>RTC I2C Command 3</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000101</resetValue>
          <fields>
            <field>
              <name>COMMAND3</name>
              <description>Content of command 3. For more information, please refer to the register
I2C_COMD3_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND3_DONE</name>
              <description>When command 3 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD4</name>
          <description>RTC I2C Command 4</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000901</resetValue>
          <fields>
            <field>
              <name>COMMAND4</name>
              <description>Content of command 4. For more information, please refer to the register
I2C_COMD4_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND4_DONE</name>
              <description>When command 4 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD5</name>
          <description>RTC I2C Command 5</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001701</resetValue>
          <fields>
            <field>
              <name>COMMAND5</name>
              <description>Content of command 5. For more information, please refer to the register
I2C_COMD5_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND5_DONE</name>
              <description>When command 5 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD6</name>
          <description>RTC I2C Command 6</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001901</resetValue>
          <fields>
            <field>
              <name>COMMAND6</name>
              <description>Content of command 6. For more information, please refer to the register
I2C_COMD6_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND6_DONE</name>
              <description>When command 6 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD7</name>
          <description>RTC I2C Command 7</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000904</resetValue>
          <fields>
            <field>
              <name>COMMAND7</name>
              <description>Content of command 7. For more information, please refer to the register
I2C_COMD7_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND7_DONE</name>
              <description>When command 7 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD8</name>
          <description>RTC I2C Command 8</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001901</resetValue>
          <fields>
            <field>
              <name>COMMAND8</name>
              <description>Content of command 8. For more information, please refer to the register
I2C_COMD8_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND8_DONE</name>
              <description>When command 8 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD9</name>
          <description>RTC I2C Command 9</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000903</resetValue>
          <fields>
            <field>
              <name>COMMAND9</name>
              <description>Content of command 9. For more information, please refer to the register
I2C_COMD9_REG in Chapter I²C Controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND9_DONE</name>
              <description>When command 9 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD10</name>
          <description>RTC I2C Command 10</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000101</resetValue>
          <fields>
            <field>
              <name>COMMAND10</name>
              <description>Content of command 10. For more information, please refer to the register
I2C_COMD10_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND10_DONE</name>
              <description>When command 10 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD11</name>
          <description>RTC I2C Command 11</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000901</resetValue>
          <fields>
            <field>
              <name>COMMAND11</name>
              <description>Content of command 11. For more information, please refer to the register
I2C_COMD11_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND11_DONE</name>
              <description>When command 11 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD12</name>
          <description>RTC I2C Command 12</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001701</resetValue>
          <fields>
            <field>
              <name>COMMAND12</name>
              <description>Content of command 12. For more information, please refer to the register
I2C_COMD12_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND12_DONE</name>
              <description>When command 12 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD13</name>
          <description>RTC I2C Command 13</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001901</resetValue>
          <fields>
            <field>
              <name>COMMAND13</name>
              <description>Content of command 13. For more information, please refer to the register
I2C_COMD13_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND13_DONE</name>
              <description>When command 13 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD14</name>
          <description>RTC I2C Command 14</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMMAND14</name>
              <description>Content of command 14. For more information, please refer to the register
I2C_COMD14_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND14_DONE</name>
              <description>When command 14 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD15</name>
          <description>RTC I2C Command 15</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMMAND15</name>
              <description>Content of command 15. For more information, please refer to the register
I2C_COMD15_REG in Chapter I²C Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND15_DONE</name>
              <description>When command 15 is done, this bit changes to 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x01905310</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
