esp-rs/esp-pacs/esp32s2-ulp/svd/esp32s2-ulp.base.svd
        <register>
          <name>SAR_SLAVE_ADDR4</name>
          <description>Configure slave addresses 6-7 of RTC I2C</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_SLAVE_ADDR7</name>
              <description>RTC I2C slave address 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SLAVE_ADDR6</name>
              <description>RTC I2C slave address 6</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TSENS_CTRL</name>
          <description>Temperature sensor data control</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00019000</resetValue>
          <fields>
            <field>
              <name>TSENS_OUT</name>
              <description>Temperature sensor data out.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSENS_READY</name>
              <description>Indicate temperature sensor out ready.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSENS_INT_EN</name>
              <description>Enable temperature sensor to send out interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_IN_INV</name>
              <description>Invert temperature sensor data.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_CLK_DIV</name>
              <description>Temperature sensor clock divider.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_POWER_UP</name>
              <description>Temperature sensor power up.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_POWER_UP_FORCE</name>
              <description>1: dump out and power up controlled by software. 0: by FSM.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_DUMP_OUT</name>
              <description>Temperature sensor dump out only active when SENS_TSENS_POWER_UP_FORCE = 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TSENS_CTRL2</name>
          <description>Temperature sensor control</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004002</resetValue>
          <fields>
            <field>
              <name>TSENS_XPD_WAIT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_XPD_FORCE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_CLK_INV</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_CLKGATE_EN</name>
              <description>Enable temperature sensor clock.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_RESET</name>
              <description>Reset temperature sensor.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_I2C_CTRL</name>
          <description>Configure RTC I2C transmission</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_CTRL</name>
              <description>RTC I2C control data. Active only when SENS_SAR_I2C_START_FORCE =
1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START</name>
              <description>Start RTC I2C. Active only when SENS_SAR_I2C_START_FORCE = 1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START_FORCE</name>
              <description>0: RTC I2C started by FSM. 1: RTC I2C started by software.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_CONF</name>
          <description>Touch sensor configuration register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFF07FFF</resetValue>
          <fields>
            <field>
              <name>TOUCH_OUTEN</name>
              <description>Enable touch controller output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_STATUS_CLR</name>
              <description>Clear all touch active status.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUCH_DATA_SEL</name>
              <description>0 and 1: touch_raw_data; 2: base_line; 3: touch_smooth_data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_DENOISE_END</name>
              <description>Touch denoise done.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_UNIT_END</name>
              <description>Indicate the completion of sampling.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_APPROACH_PAD2</name>
              <description>Indicate which pad is selected as proximity pad2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_APPROACH_PAD1</name>
              <description>Indicate which pad is selected as proximity pad1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_APPROACH_PAD0</name>
              <description>Indicate which pad is selected as proximity pad0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES1</name>
          <description>Finger threshold for touch pad 1</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH1</name>
              <description>Finger threshold for touch pad 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES2</name>
          <description>Finger threshold for touch pad 2</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH2</name>
              <description>Finger threshold for touch pad 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES3</name>
          <description>Finger threshold for touch pad 3</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH3</name>
              <description>Finger threshold for touch pad 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES4</name>
          <description>Finger threshold for touch pad 4</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH4</name>
              <description>Finger threshold for touch pad 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES5</name>
          <description>Finger threshold for touch pad 5</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH5</name>
              <description>Finger threshold for touch pad 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES6</name>
          <description>Finger threshold for touch pad 6</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH6</name>
              <description>Finger threshold for touch pad 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES7</name>
          <description>Finger threshold for touch pad 7</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH7</name>
              <description>Finger threshold for touch pad 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES8</name>
          <description>Finger threshold for touch pad 8</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH8</name>
              <description>Finger threshold for touch pad 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES9</name>
          <description>Finger threshold for touch pad 9</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH9</name>
              <description>Finger threshold for touch pad 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES10</name>
          <description>Finger threshold for touch pad 10</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH10</name>
              <description>Finger threshold for touch pad 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES11</name>
          <description>Finger threshold for touch pad 11</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH11</name>
              <description>Finger threshold for touch pad 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES12</name>
          <description>Finger threshold for touch pad 12</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH12</name>
              <description>Finger threshold for touch pad 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES13</name>
          <description>Finger threshold for touch pad 13</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH13</name>
              <description>Finger threshold for touch pad 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES14</name>
          <description>Finger threshold for touch pad 14</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH14</name>
              <description>Finger threshold for touch pad 14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_CHN_ST</name>
          <description>Touch channel status register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD_ACTIVE</name>
              <description>Touch active status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_CHANNEL_CLR</name>
              <description>Clear touch channel</description>
              <bitOffset>15</bitOffset>
              <bitWidth>15</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUCH_MEAS_DONE</name>
              <description>Signal flag that indicates one touch pad is done.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS0</name>
          <description>Status of touch controller</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_DENOISE_DATA</name>
              <description>Denoise measure value from touch sensor 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_SCAN_CURR</name>
              <description>Current pad in scan status</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS1</name>
          <description>Touch pad 1 status</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD1_DATA</name>
              <description>The data of touch pad 1, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD1_DEBOUNCE</name>
              <description>Touch pad 1 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS2</name>
          <description>Touch pad 2 status</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD2_DATA</name>
              <description>The data of touch pad 2, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD2_DEBOUNCE</name>
              <description>Touch pad 2 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS3</name>
          <description>Touch pad 3 status</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD3_DATA</name>
              <description>The data of touch pad 3, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD3_DEBOUNCE</name>
              <description>Touch pad 3 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS4</name>
          <description>Touch pad 4 status</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD4_DATA</name>
              <description>The data of touch pad 4, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD4_DEBOUNCE</name>
              <description>Touch pad 4 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS5</name>
          <description>Touch pad 5 status</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD5_DATA</name>
              <description>The data of touch pad 5, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD5_DEBOUNCE</name>
              <description>Touch pad 5 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS6</name>
          <description>Touch pad 6 status</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD6_DATA</name>
              <description>The data of touch pad 6, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD6_DEBOUNCE</name>
              <description>Touch pad 6 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS7</name>
          <description>Touch pad 7 status</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD7_DATA</name>
              <description>The data of touch pad 7, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD7_DEBOUNCE</name>
              <description>Touch pad 7 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
