esp-rs/esp-pacs/esp32s2-ulp/svd/esp32s2-ulp.base.svd
        <register>
          <name>SAR_TOUCH_STATUS8</name>
          <description>Touch pad 8 status</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD8_DATA</name>
              <description>The data of touch pad 8, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD8_DEBOUNCE</name>
              <description>Touch pad 8 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS9</name>
          <description>Touch pad 9 status</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD9_DATA</name>
              <description>The data of touch pad 9, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD9_DEBOUNCE</name>
              <description>Touch pad 9 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS10</name>
          <description>Touch pad 10 status</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD10_DATA</name>
              <description>The data of touch pad 10, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD10_DEBOUNCE</name>
              <description>Touch pad 10 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS11</name>
          <description>Touch pad 11 status</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD11_DATA</name>
              <description>The data of touch pad 11, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD11_DEBOUNCE</name>
              <description>Touch pad 11 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS12</name>
          <description>Touch pad 12 status</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD12_DATA</name>
              <description>The data of touch pad 12, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD12_DEBOUNCE</name>
              <description>Touch pad 12 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS13</name>
          <description>Touch pad 13 status</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD13_DATA</name>
              <description>The data of touch pad 13, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD13_DEBOUNCE</name>
              <description>Touch pad 13 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS14</name>
          <description>Touch pad 14 status</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_PAD14_DATA</name>
              <description>The data of touch pad 14, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_PAD14_DEBOUNCE</name>
              <description>Touch pad 14 debounce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS15</name>
          <description>Touch sleep pad status</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_SLP_DATA</name>
              <description>The data of touch sleep pad, depending on the setting of SENS_TOUCH_DATA_SEL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_SLP_DEBOUNCE</name>
              <description>Touch sleep pad debouce value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS16</name>
          <description>Touch approach count status</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_APPROACH_PAD2_CNT</name>
              <description>Count status of proximity pad 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_APPROACH_PAD1_CNT</name>
              <description>Count status of proximity pad 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_APPROACH_PAD0_CNT</name>
              <description>Count status of proximity pad 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_SLP_APPROACH_CNT</name>
              <description>Count status of sleep pad in proximity mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_DAC_CTRL1</name>
          <description>DAC control</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SW_FSTEP</name>
              <description>Frequency step for CW generator can be used to adjust the frequency.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_TONE_EN</name>
              <description>0: disable CW generator. 1: enable CW generator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUG_BIT_SEL</name>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_DIG_FORCE</name>
              <description>0: DAC1 and DAC2 do not use DMA. 1: DAC1 and DAC2 use DMA.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLK_FORCE_LOW</name>
              <description>1: force PDAC_CLK to low</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLK_FORCE_HIGH</name>
              <description>1: force PDAC_CLK to high</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLK_INV</name>
              <description>1: invert PDAC_CLK.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_RESET</name>
              <description>Reset DAC by software.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLKGATE_EN</name>
              <description>DAC clock gate enable bit.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_DAC_CTRL2</name>
          <description>DAC output control</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <resetValue>0x03000000</resetValue>
          <fields>
            <field>
              <name>DAC_DC1</name>
              <description>DC offset for DAC1 CW generator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_DC2</name>
              <description>DC offset for DAC2 CW generator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_SCALE1</name>
              <description>DAC1 scaling. 00: no scale. 01: scale to 1/2. 10: scale to 1/4. 11: scale to 1/8.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_SCALE2</name>
              <description>DAC2 scaling. 00: no scale. 01: scale to 1/2. 10: scale to 1/4. 11: scale to 1/8.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_INV1</name>
              <description>Invert DAC1. 00: do not invert any bits. 01: invert all bits. 10: invert MSB. 11: invert all bits except MSB.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_INV2</name>
              <description>Invert DAC2. 00: do not invert any bits. 01: invert all bits. 10: invert MSB. 11: invert all bits except MSB.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CW_EN1</name>
              <description>1: select CW generator as source for PDAC1_DAC. 0: select register RT- CIO_PDAC1_DAC as source for PDAC1_DAC.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CW_EN2</name>
              <description>1: select CW generator as source for PDAC2_DAC. 0: select register RT- CIO_PDAC2_DAC as source for PDAC2_DAC.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_STATE</name>
          <description>ULP-RISCV status</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_DBG_TRIGGER</name>
              <description>Trigger ULP-RISCV debug registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_CLK_EN</name>
              <description>Check ULP-RISCV whether clk on</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_RESET_N</name>
              <description>Check ULP-RISCV whether in reset state</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_EOI</name>
              <description>Check ULP-RISCV whether in interrupt state</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TRAP</name>
              <description>Check ULP-RISCV whether in trap state</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_EBREAK</name>
              <description>Check ULP-RISCV whether in ebreak</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_RAW</name>
          <description>Interrupt raw bit of ULP-RISCV</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_TOUCH_DONE_INT_RAW</name>
              <description>TOUCH_DONE_INT interrupt raw bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_INACTIVE_INT_RAW</name>
              <description>TOUCH_INACTIVE_INT interrupt raw bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_ACTIVE_INT_RAW</name>
              <description>TOUCH_ACTIVE_INT interrupt raw bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_INT_RAW</name>
              <description>SARADC1_DONE_INT interrupt raw bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_RAW</name>
              <description>SARADC2_DONE_INT interrupt raw bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TSENS_INT_RAW</name>
              <description>TSENS_DONE_INT interrupt raw bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_START_INT_RAW</name>
              <description>RISCV_START_INT interrupt raw bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SW_INT_RAW</name>
              <description>SW_INT interrupt raw bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SWD_INT_RAW</name>
              <description>SWD_INT interrupt raw bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_ENA</name>
          <description>Interrupt enable bit of ULP-RISCV</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_TOUCH_DONE_INT_ENA</name>
              <description>TOUCH_DONE_INT interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_TOUCH_INACTIVE_INT_ENA</name>
              <description>TOUCH_INACTIVE_INT interrupt enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_TOUCH_ACTIVE_INT_ENA</name>
              <description>TOUCH_ACTIVE_INT interrupt enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC1_INT_ENA</name>
              <description>SARADC1_DONE_INT interrupt enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_ENA</name>
              <description>SARADC2_DONE_INT interrupt enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_TSENS_INT_ENA</name>
              <description>TSENS_DONE_INT interrupt enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_START_INT_ENA</name>
              <description>RISCV_START_INT interrupt enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SW_INT_ENA</name>
              <description>SW_INT interrupt enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SWD_INT_ENA</name>
              <description>SWD_INT interrupt enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
