esp-rs/esp-pacs/esp32s2-ulp/svd/esp32s2-ulp.base.svd
        <register>
          <name>SAR_COCPU_INT_ST</name>
          <description>Interrupt status bit of ULP-RISCV</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_TOUCH_DONE_INT_ST</name>
              <description>TOUCH_DONE_INT interrupt status bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_INACTIVE_INT_ST</name>
              <description>TOUCH_INACTIVE_INT interrupt status bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_ACTIVE_INT_ST</name>
              <description>TOUCH_ACTIVE_INT interrupt status bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_INT_ST</name>
              <description>SARADC1_DONE_INT interrupt status bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_ST</name>
              <description>SARADC2_DONE_INT interrupt status bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TSENS_INT_ST</name>
              <description>TSENS_DONE_INT interrupt status bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_START_INT_ST</name>
              <description>RISCV_START_INT interrupt status bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SW_INT_ST</name>
              <description>SW_INT interrupt status bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SWD_INT_ST</name>
              <description>SWD_INT interrupt status bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_CLR</name>
          <description>Interrupt clear bit of ULP-RISCV</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_TOUCH_DONE_INT_CLR</name>
              <description>TOUCH_DONE_INT interrupt clear bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_INACTIVE_INT_CLR</name>
              <description>TOUCH_INACTIVE_INT interrupt clear bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_ACTIVE_INT_CLR</name>
              <description>TOUCH_ACTIVE_INT interrupt clear bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_INT_CLR</name>
              <description>SARADC1_DONE_INT interrupt clear bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_CLR</name>
              <description>SARADC2_DONE_INT interrupt clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_TSENS_INT_CLR</name>
              <description>TSENS_DONE_INT interrupt clear bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_START_INT_CLR</name>
              <description>RISCV_START_INT interrupt clear bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SW_INT_CLR</name>
              <description>SW_INT interrupt clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SWD_INT_CLR</name>
              <description>SWD_INT interrupt clear bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_DEBUG</name>
          <description>ULP-RISCV debug register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_PC</name>
              <description>ULP-RISCV Program counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_MEM_VLD</name>
              <description>ULP-RISCV memory valid output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_MEM_RDY</name>
              <description>ULP-RISCV memory ready input</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_MEM_WEN</name>
              <description>ULP-RISCV memory write enable output</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_MEM_ADDR</name>
              <description>ULP-RISCV memory address output</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_HALL_CTRL</name>
          <description>hall control</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <resetValue>0xA0000000</resetValue>
          <fields>
            <field>
              <name>XPD_HALL</name>
              <description>Power on hall sensor and connect to VP and VN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_HALL_FORCE</name>
              <description>1: XPD HALL is controlled by SW. 0: XPD HALL is controlled by FSM in ULP-coprocessor</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALL_PHASE</name>
              <description>Reverse phase of hall sensor</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALL_PHASE_FORCE</name>
              <description>1: HALL PHASE is controlled by SW  0: HALL PHASE is controlled by FSM in ULP-coprocessor</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_NOUSE</name>
          <description>sar nouse</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_NOUSE</name>
              <description>sar nouse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_IO_MUX_CONF</name>
          <description>Configure and reset IO MUX</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IOMUX_RESET</name>
              <description>Reset IO MUX by software</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMUX_CLK_GATE_EN</name>
              <description>IO MUX clock gate enable bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARDATE</name>
          <description>Version Control Register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <resetValue>0x01906140</resetValue>
          <fields>
            <field>
              <name>SAR_DATE</name>
              <description>Version Control Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>